# На вход программе подаются 3 коэффициента квадратного уравнения.
# Программа должна находить корни квадратного уравнения

from math import*

a, b, c = float(input('a = ')), float(input('b = ')), float(input('c = '))

if a != 0:
    discr = b ** 2 - 4 * a * c
    if discr < 0:
        print('Нет решений')
    elif discr == 0:
        print(b / (2 * a))
    else:
        print(f'Дискриминант данного уравнения равен: {discr}')
        print((-b - sqrt(discr)) / (2 * a))
        print((-b + sqrt(discr)) / (2 * a))
else:
    print('Коэффициент при x^2 квадратного уравнения не может быть равен 0, иначе это не квадратное уравнение. '
          'Введите значение отличное от 0')
