# ТЗ по боту:
#  1) Формат имени
#  2) Манера общения = "На вы"
#  3) Использование бд PostgreSQL
#  4) Использование данной апи
#  5) Использование psycopg2
#  6) Формат вывода расписания на каждый день недели:
#     < День недели>
#     < Предмет > < Кабинет > < Время > < Преподаватель >
#     ...
#  7) Во время работы бота должны быть отображены следующие графические кнопки:
#     Понедельник
#     Вторник
#     Среда
#     Четверг
#     Пятница 
#     Расписание на текущую неделю
#     Расписание на следующую неделю
#  8) При нажатии на кнопку с днём недели бот должен выводить информацию из бд
#  с расписанием на выбранный день текущий недели
#  9) При нажатии на кнопку "Расписание на текущую неделю" бот должен выводить
#  информацию из бд с расписанием на всю текущую неделю
#  10) При нажатии на кнопку "Расписание на следующую неделю" бот должен выводить
#  информацию из бд с расписанием на всю следующую неделю
#  11) Команда /week - вывод недели на данный момент - верхняя/нижняя
#  12) Команда /mtuci - ссылка на mtuci.ru 
#  13) Команда /help - вывод краткой информации о себе, краткой документации и
#  список команд
#  14) При вводе неизвестной команды или неизвестного боту сообщения, бот должен
#  отправлять сообщение - "Извините, я Вас не понял"
#  15) Структура бд должна соответствовать схеме в методичке


import telebot, psycopg2
from telebot import types


token = "5822901262:AAGaQ65BSEimFLHxnSZcjLqzvike8PD2aM0"

bot = telebot.TeleBot(token)


@bot.message_handler(commands=['start'])
def start(message):
    keyboard = types.ReplyKeyboardMarkup() #Класс создаёт кастом клавиаутуру с текстовыми кнопками вместо обычной клавы
    keyboard.row("Хочу", "/help") # Заполняет кастом клаву кнопками
    bot.send_message(message.chat.id, 'Здравствуйте! Хотите узнать свежую информацию о МТУСИ?', reply_markup=keyboard)
    # отправляет пользователю сообщение

@bot.message_handler(commands=['help'])
def start_message(message):
    bot.send_message(message.chat.id, 'Основная моя функция - отображать расписание, но мои создатели наделили меня \
ещё несколькими возможностями: ')


@bot.message_handler(content_types=['text'])
def answer(message):
    if message.text.lower() == "хочу":
        bot.send_message(message.chat.id, "Тогда тебе сюда - https://mtuci.ru")


bot.polling(none_stop=True, interval=0)